[
{ "code": "H", "type": "High Gain Seismometer", "desc": "Measures displacement/velocity/acceleration along a line defined by the the dip and azimuth." },
{ "code": "L", "type": "Low Gain Seismometer", "desc": "Measures displacement/velocity/acceleration along a line defined by the the dip and azimuth." },
{ "code": "M", "type": "Mass Position Seismometer", "desc": "Measures displacement/velocity/acceleration along a line defined by the the dip and azimuth." },
{ "code": "N", "type": "Accelerometer", "desc": "Measures displacement/velocity/acceleration along a line defined by the the dip and azimuth." },
{ "code": "P", "type": "Geophone, very short period seismometer with natural frequency 5 - 10 Hz or higher", "desc": "Measures displacement/velocity/acceleration along a line defined by the the dip and azimuth." },
{ "code": "A", "type": "Tilt Meter", "desc": "Measures tilt from the horizontal plane. Azimuth is typically N/S or E/W." },
{ "code": "B", "type": "Creep Meter", "desc": "Measures the absolute movement between two sides of a fault. Traditionally this has been done by means of fixing a metal beam on one side of the fault and measuring its position on the other side, but can also done with light beams, triangulation wires and other techniques.\nThe orientation and therefore the dip and azimuth would be perpendicular to the measuring beam, which would be along the average travel vector for the fault. Position/negative travel would be arbitrary, but would be noted in the dip/azimuth." },
{ "code": "C", "type": "Calibration Input", "desc": "Usually only used for seismometers or other magnetic coil instruments. This signal monitors the input signal to the coil to be used in response evaluation. Usually tied to a specific instrument. Sometimes all instruments are calibrated together, sometimes horizontals are calibrated separately from verticals." },
{ "code": "D", "type": "Pressure", "desc": "A barometer, microbarometer, or other gauge that measures pressure. Used to measure atmospheric, water, and any other pressure.  This includes infrasonic and hydrophone measurements." },
{ "code": "E", "type": "Electronic Test Point", "desc": "Used to monitor circuitry inside recording system, local power or seismometer. Usually for power supply voltages, or line voltages." },
{ "code": "F", "type": "Magnetometer", "desc": "Measures the magnetic field at the sensor location. They measure the part of the field vector that is aligned with the measurement coil. Many magnetometers are three axis. The instrument will typically be oriented to local magnetic north. The dip and azimuth should describe this in terms of the geographic north.\nExample: Assuming magnetic north is 13 degrees east of north at the recording site, if the magnetometer is pointed to magnetic north, the azimuth would be + 103 for the E channel. Some magnetometers do not record any vector quantity associated with the signal, but record the total intensity. So, these would not have any dip or azimuth." },
{ "code": "I", "type": "Humidity", "desc": "Absolute/relative measurements of humidity. Temperature recordings may also be needed for meaningful results." },
{ "code": "J", "type": "Rotational Sensor", "desc": "Measures solid-body rotations about an axis, commonly given in “displacement” (radians), velocity (radians/second) or acceleration (radians/second**2)." },
{ "code": "K", "type": "Temperature", "desc": "Measurement of the temperature at some location. Typically used for measuring:" },
{ "code": "O", "type": "Water Current", "desc": "Measurement of the velocity of water in a given direction. The measurement may be at depth, within a borehole or a variety of other locations." },
{ "code": "G", "type": "Gravimeter", "desc": "Measurement of a gravitational field." },
{ "code": "Q", "type": "Electric Potential", "desc": "Measures the Electric Potential between two points. This is normally done using a high impedance voltmeter connected to two electrodes driven into the ground. In the case of magnetotelleuric work, this is one parameter that must be measured." },
{ "code": "R", "type": "Rainfall", "desc": "Measures total rainfall, or an amount per sampling interval" },
{ "code": "S", "type": "Linear Strain", "desc": "Dip/Azimuth are the line of the movement being measured. Positive values are obtained when stress/distance increases and negative when they decrease." },
{ "code": "T", "type": "Tide", "desc": "Measurement of depth of water at monitoring site. Not to be confused with lunar tidal filters or gravimeter output." },
{ "code": "U", "type": "Bolometer", "desc": "Infrared instrument used to evaluate average cloud cover. Used in astronomy to determine observability of the sky." },
{ "code": "V", "type": "Volumetric Strain", "desc": "" },
{ "code": "W", "type": "Wind", "desc": "Measures the wind vector or velocity. Normal notion of dip and azimuth does not apply." },
{ "code": "X", "type": "Derived or generated channel", "desc": "Time series derived from observational data or entirely generated by a computer." },
{ "code": "Y", "type": "Non-specific instruments", "desc": "For instruments not specifically covered by an existing Source Code the Y Source Code can be used." },
{ "code": "Z", "type": "Synthesized Beams", "desc": "This is used when forming beams from individual elements of an array." }
]
